---
type: ExternalServiceOptions
namespace: Autodesk.Revit.DB.ExternalService
version: 2024
members: 7
tags: [revit-api, class]
---

# ExternalServiceOptions

`Autodesk.Revit.DB.ExternalService.ExternalServiceOptions` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ExternalServiceOptions | 2014 | `public ExternalServiceOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsPublic | 2014 | `public bool IsPublic { get ; set ; }` |
| Property | IsRecordable | 2014 | `public bool IsRecordable { get ; set ; }` |
| Property | IsSelfsynchronizing | 2014 | `public bool IsSelfsynchronizing { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | SupportActivation | 2024 | `public bool SupportActivation { get ; set ; }` |